In [1]:
import numpy as np
import pandas as pd
pd.__version__

'1.3.4'

In [3]:
student_record_file_name = "fake_student_records.csv"
scores = pd.read_csv(student_record_file_name)
scores.head()

    이름        학번    소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
0  길은영  20267377  일본학과   3   61   69   46   79   57   77   56   65
1  임희윤  20337377  심리학과   2   76   62   62   64   77  100   51   94
2  류준산  20266173  경제학과   2   98   84   79   87   70   97   89   52
3  한성빈  20314864  경제학과   3   75   63   59   81   83   90   93   71
4  김화원  20277416  경영학과   3   45   90   86   94   94   52   76   84

In [5]:
scores['과제1']

0     61
1     76
2     98
3     75
4     45
      ..
71    91
72    68
73    64
74    60
75    67
Name: 과제1, Length: 76, dtype: int64

In [9]:
scores[['과제1','과제2']]

    과제1  과제2
0    61   69
1    76   62
2    98   84
3    75   63
4    45   90
..  ...  ...
71   91   78
72   68   62
73   64   65
74   60   82
75   67   62

[76 rows x 2 columns]

In [10]:
# 특정 행에 접근하기 위해서는 loc 사용
scores.loc[3]

이름          한성빈
학번     20314864
소속         경제학과
학년            3
과제1          75
과제2          63
과제3          59
과제4          81
과제5          83
과제6          90
과제7          93
과제8          71
Name: 3, dtype: object

In [11]:
scores.loc[[3,5]]

    이름        학번     소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
3  한성빈  20314864   경제학과   3   75   63   59   81   83   90   93   71
5  강화윤  20278703  생명과학과   3   77   60   73   87   56   88   93   75

In [13]:
scores.loc[3, '과제1']

75

In [14]:
scores.loc[[3,5], ['과제1', '과제2']]

   과제1  과제2
3   75   63
5   77   60

In [15]:
scores.loc[3:6, ['과제1', '과제2']]

   과제1  과제2
3   75   63
4   45   90
5   77   60
6   71   69

## Looping over Serias

In [17]:
s = scores.loc[3]
type(s)

pandas.core.series.Series

In [18]:
c = scores['과제1']
type(c)

pandas.core.series.Series

In [20]:
for e in s: # 판다스에서 반환형은 시리즈이기 때문에 다음과 같은 for문 적용이 가능함.
    print(e)

한성빈
20314864
경제학과
3
75
63
59
81
83
90
93
71

In [22]:
for i in s.index:
    print(s[i])

한성빈
20314864
경제학과
3
75
63
59
81
83
90
93
71

## Pandas Serias 함수

In [24]:
scores.set_index('이름', inplace = True)
scores.head()

           학번    소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
길은영  20267377  일본학과   3   61   69   46   79   57   77   56   65
임희윤  20337377  심리학과   2   76   62   62   64   77  100   51   94
류준산  20266173  경제학과   2   98   84   79   87   70   97   89   52
한성빈  20314864  경제학과   3   75   63   59   81   83   90   93   71
김화원  20277416  경영학과   3   45   90   86   94   94   52   76   84

In [30]:
s = scores.loc['길은영']
s

# 판다스에서 하나의 행이나 열을 뽑았을 경우에 Serias 형으로 타입을 반환한다.
# 이 때 이 시리즈의 원소들이 여러개의 복합형일 경우 dtype이 object형으로 뜨게 된다.

학번     20267377
소속         일본학과
학년            3
과제1          61
과제2          69
과제3          46
과제4          79
과제5          57
과제6          77
과제7          56
과제8          65
Name: 길은영, dtype: object

In [31]:
c = scores['과제1']
c

이름
길은영    61
임희윤    76
류준산    98
한성빈    75
김화원    45
       ..
신한산    91
윤주인    68
김여환    64
남용원    60
이은경    67
Name: 과제1, Length: 76, dtype: int64

In [32]:
type(s.loc['과제1'])

numpy.int64

In [33]:
type(s.loc['소속'])

str

## min(), max(), mean()

In [34]:
c.min(), c.max(), c.mean()

(45, 100, 73.71052631578948)

In [36]:
# s.mean()
# 문자형 데이터가 포함이 되어있기 때문.

In [37]:
scores.min() # 각 컬럼별 최솟값을 가지는 인덱스를 반환함.

학번     20255161
소속     AI의료융합전공
학년            1
과제1          45
과제2          42
과제3          41
과제4          45
과제5          43
과제6          41
과제7          41
과제8          43
dtype: object

In [38]:
scores['학번'].min()

20255161

In [39]:
scores['소속'].min()

'AI의료융합전공'

In [40]:
scores['과제1'].min()

45

## add(), sub(), substract(), mul(), multiply(), div(), divide(), mod()

In [42]:
d = {'a':[1,3,5], 'b':[2,4,np.NaN]}
df1 = pd.DataFrame(d)
df1

   a    b
0  1  2.0
1  3  4.0
2  5  NaN

In [44]:
df1.dtypes

a      int64
b    float64
dtype: object

In [45]:
c1 = df1['a']
c2 = df1['b']

In [46]:
c1 + 3

0    4
1    6
2    8
Name: a, dtype: int64

In [47]:
c1.add(3)

0    4
1    6
2    8
Name: a, dtype: int64

In [49]:
c2.add(20)

0    22.0
1    24.0
2     NaN
Name: b, dtype: float64

In [51]:
c2.add(2, fill_value = 0) # fill_value 의 경우 NaN 값을 먼저 해당 값으로 바꾼 후 연산을 진행함.

0    4.0
1    6.0
2    2.0
Name: b, dtype: float64

In [52]:
c1.add(c2, fill_value = 0)

0    3.0
1    7.0
2    5.0
dtype: float64

In [71]:
c3 = c2.copy()
c3.add(c2, fill_value = 0) # 여전히 NaN이 포함되어있음.

0    4.0
1    8.0
2    NaN
Name: b, dtype: float64

In [72]:
c3, c2

(0    2.0
 1    4.0
 2    NaN
 Name: b, dtype: float64,
 0    2.0
 1    4.0
 2    NaN
 Name: b, dtype: float64)

In [58]:
d2 = {'a' : [1, np.NaN, 5], 'b':[2,4,np.NaN]}
df2 = pd.DataFrame(d2)
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [63]:
c3 = df2['a']
c4 = df2['b']

In [64]:
c3.add(c4, fill_value = 0)

0    3.0
1    4.0
2    5.0
dtype: float64

In [65]:
c4.add(c3, fill_value = 0)

0    3.0
1    4.0
2    5.0
dtype: float64

In [66]:
c3 - c4

0   -1.0
1    NaN
2    NaN
dtype: float64

In [67]:
c3.sub(c4, fill_value= 0)

0   -1.0
1   -4.0
2    5.0
dtype: float64

In [68]:
c3.mul(c4, fill_value = 0)

0    2.0
1    0.0
2    0.0
dtype: float64

In [69]:
c3.div(c4, fill_value = 0) # 0으로 나눴을 때 몫은 inf

0    0.5
1    0.0
2    inf
dtype: float64

In [70]:
c3.mod(c4, fill_value = 0)

0    1.0
1    0.0
2    NaN
dtype: float64

In [73]:
tdf1 = pd.DataFrame([[1, 2], [3, 4]],
    index=['idx1', 'idx2'],
    columns=['col1', 'col2'])

In [74]:
tdf1

      col1  col2
idx1     1     2
idx2     3     4

In [75]:
tdf2 = tdf1.copy()
tdf2.index = ['idx2', 'idx3']
tdf2

      col1  col2
idx2     1     2
idx3     3     4

In [76]:
tdf1 + tdf2

      col1  col2
idx1   NaN   NaN
idx2   4.0   6.0
idx3   NaN   NaN

In [77]:
tdf1.add(tdf2)

      col1  col2
idx1   NaN   NaN
idx2   4.0   6.0
idx3   NaN   NaN

In [78]:
tdf3 = tdf1.copy()
tdf3.columns = ['col2', 'col3']
tdf3

      col2  col3
idx1     1     2
idx2     3     4

In [79]:
tdf1 + tdf3

      col1  col2  col3
idx1   NaN     3   NaN
idx2   NaN     7   NaN

In [80]:
tdf1.add(tdf3)

      col1  col2  col3
idx1   NaN     3   NaN
idx2   NaN     7   NaN

In [82]:
c3, c4

(0    2.0
 1    4.0
 2    NaN
 Name: b, dtype: float64,
 0    2.0
 1    4.0
 2    NaN
 Name: b, dtype: float64)

In [81]:
c3 < c4

0    False
1    False
2    False
Name: b, dtype: bool

In [83]:
c3.lt(c4, fill_value = 0)

0    False
1    False
2    False
Name: b, dtype: bool

## gt(), ge(), lt(), le(), eq(), equals(), ne()

- gt() : greater then
- ge() : greater then equal to 크거나 같음
- ... ect

In [86]:
c3 <= c4

0     True
1     True
2    False
Name: b, dtype: bool

In [87]:
d3 = {'a': [0, 5, 2], 'b': [1, 10, np.NaN]}
df3 = pd.DataFrame(d3)
df3

   a     b
0  0   1.0
1  5  10.0
2  2   NaN

In [88]:
df2 - df3

     a    b
0  1.0  1.0
1  NaN -6.0
2  3.0  NaN

In [89]:
df2.sub(df3, fill_value = 0)

     a    b
0  1.0  1.0
1 -5.0 -6.0
2  3.0  NaN

In [92]:
df2, df3 # 적용이 됐다고 하더라도 0 + NaN은 NaN 이기 때문에

(     a    b
 0  1.0  2.0
 1  NaN  4.0
 2  5.0  NaN,
    a     b
 0  0   1.0
 1  5  10.0
 2  2   NaN)

##  Pandas.Serias.add_suffix(), pandas.Serias.add_prefix()

- suffix : 접미사
- prefix : 접두사

-> 기존의 레이블 뒤에 적용하는 역할을 함.

In [97]:
s

학번     20267377
소속         일본학과
학년            3
과제1          61
과제2          69
과제3          46
과제4          79
과제5          57
과제6          77
과제7          56
과제8          65
Name: 길은영, dtype: object

In [99]:
s.add_suffix('_2026')
# 변환 내용이 바뀌는 것이 아님! 반환형이 있기 때문에 무언가 받아주어야 함.

학번_2026     20267377
소속_2026         일본학과
학년_2026            3
과제1_2026          61
과제2_2026          69
과제3_2026          46
과제4_2026          79
과제5_2026          57
과제6_2026          77
과제7_2026          56
과제8_2026          65
Name: 길은영, dtype: object

In [100]:
s

학번     20267377
소속         일본학과
학년            3
과제1          61
과제2          69
과제3          46
과제4          79
과제5          57
과제6          77
과제7          56
과제8          65
Name: 길은영, dtype: object

In [101]:
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [102]:
df2.add_suffix('_col')

   a_col  b_col
0    1.0    2.0
1    NaN    4.0
2    5.0    NaN

In [103]:
df2.add_prefix('pre_')

   pre_a  pre_b
0    1.0    2.0
1    NaN    4.0
2    5.0    NaN

In [104]:
s.add_suffix('aaa')

학번aaa     20267377
소속aaa         일본학과
학년aaa            3
과제1aaa          61
과제2aaa          69
과제3aaa          46
과제4aaa          79
과제5aaa          57
과제6aaa          77
과제7aaa          56
과제8aaa          65
Name: 길은영, dtype: object

## 데이터 정제에 필요한 Missing value 처리 함수

- pandas.DataFrame.dropna
- pandas.DataFrame.fillna
- pandas.DataFrame.interpolate

## NaN : Missing Value(Not a Number), 누락된 데이터 처리

- Pandas가 NaN을 표시할 때는 넘파이의 NaN을 사용함.
- 넘파이의 NaN 객체는 일반적으로 값이 정의되지 않은 형태를 뜻함
- 파이썬과 넘파이 모두 실수 데이터를 표시할 때 IEEE 754를 사용하는데 여기서 NaN은 정의되지 않은 숫자 즉 숫자로 표현할 수 없는 것을 의미

In [105]:
np.inf > 10

True

In [111]:
np.inf < 10

False

In [107]:
np.inf + 10

inf

In [108]:
np.inf > np.nan

False

In [109]:
np.nan > 10

False

## dropna : Na가 포함되어있는 행 전체 제거

In [112]:
df2

     a    b
0  1.0  2.0
1  NaN  4.0
2  5.0  NaN

In [110]:
df2.dropna()

     a    b
0  1.0  2.0

In [117]:
df_tmp = df2.copy()
df_tmp.dropna(inplace = True)
df_tmp

     a    b
0  1.0  2.0

## Fillna는 NaN값에 특정값으로 대체하는 함수

In [118]:
df2.fillna(0)

     a    b
0  1.0  2.0
1  0.0  4.0
2  5.0  0.0

In [119]:
df_tmp = df2.copy()
df_tmp.fillna(0, inplace = True)
df_tmp

     a    b
0  1.0  2.0
1  0.0  4.0
2  5.0  0.0

In [122]:
df_tmp = df2.copy()
# 선형보간을 사용하여 자동으로 보간을 적용.
# 3.0은 1.0과 5.0 사이의 평균이 적용된 것!, 
# 4.0은 4.0은 위에 있는데 밑이 없으므로 그냥 4.0 같이 넣어줌
df_tmp.interpolate()

     a    b
0  1.0  2.0
1  3.0  4.0
2  5.0  4.0

## pandas.DataFrame.replace

- Na값을 대체하는 것이 아닌 특정 값 대체 가능

In [126]:
 df = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                    'col2': [2, 3, 4, 5, 6],
                    'col3': [1, 3, 2, 4, 9]})
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [127]:
df == 4

    col1   col2   col3
0  False  False  False
1  False  False  False
2   True   True  False
3  False  False   True
4   True  False  False

In [129]:
# bool 연산을 통해 인덱스를 변경 가능
df[df==4] = 14
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2    14    14     2
3     2     5    14
4    14     6     9

In [130]:
df2 = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                    'col2': list('abcde'),
                    'col3': [1, 3, 2, 4, 9]})
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2     4    c     2
3     2    d     4
4     4    e     9

In [132]:
# df2[df2 == 4] = 14 -> 데이터 프레임의 자료형이 다를 경우 오류 발생.

In [134]:
# 다음과 같이 replace를 통해 수정 가능
df2.replace(14,4)

   col1 col2  col3
0     0    a     1
1     2    b     3
2     4    c     2
3     2    d     4
4     4    e     9

In [137]:
# 혼합된 자료형을 가진 데이터 프레임에서도 사용이 가능함.
df2.replace(4,14)

# 다음과 같은 대화형 셀에서 밑의 출력결과가 나온다는 것은 해당 문법이 반환을 한다는 것을 말함.

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

In [139]:
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2     4    c     2
3     2    d     4
4     4    e     9

In [140]:
df2.replace(4,14, inplace = True)

In [141]:
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

## pandas 함수 적용 

- map() : Serias에만 함수 적용
- apply() : 행 또는 열에 함수 적용
- applymap() : 원소 단위에 함수 적용
- pipe() : DataFrame 전체에 함수 적용

In [142]:
lst = [1,3,5]
list(map(lambda x: x**2, lst))

[1, 9, 25]

In [144]:
arr = np.array([1,3,5])
arr ** 2

array([ 1,  9, 25], dtype=int32)

In [145]:
c1

0    1
1    3
2    5
Name: a, dtype: int64

In [146]:
c1.map(lambda x: x**2 )

0     1
1     9
2    25
Name: a, dtype: int64

In [147]:
df2

   col1 col2  col3
0     0    a     1
1     2    b     3
2    14    c     2
3     2    d    14
4    14    e     9

In [149]:
# df2.map(lambda x : x**2) 
# map 은 Serias 데이터에만 적용이 가능!

In [150]:
# apply : 행 또는 열에 함수 적용

In [152]:
df = pd.DataFrame({'col1': [0, 2, 4, 2, 4],
                    'col2': [2, 3, 4, 5, 6],
                    'col3': [1, 3, 2, 4, 9]})
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [153]:
df.apply(np.sum, axis = 0)

col1    12
col2    20
col3    19
dtype: int64

In [154]:
np.sum(df, axis =  0)

col1    12
col2    20
col3    19
dtype: int64

In [155]:
df.apply(np.sum, axis = 1)

0     3
1     8
2    10
3    11
4    19
dtype: int64

In [156]:
np.sum(df, axis = 1)

0     3
1     8
2    10
3    11
4    19
dtype: int64

In [158]:
# 반환되는 타입의 shape을 원래 data shape 과 동일하게 하고 싶은경우 result_type을 broadcast로 적용
df.apply(np.sum, axis = 0 , result_type='broadcast')

   col1  col2  col3
0    12    20    19
1    12    20    19
2    12    20    19
3    12    20    19
4    12    20    19

## applymap() : 원소 단위에 함수 적용

In [160]:
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [161]:
f1 = lambda x: x**2 + 1
df.applymap(f1)

   col1  col2  col3
0     1     5     2
1     5    10    10
2    17    17     5
3     5    26    17
4    17    37    82

In [162]:
df ** 2 + 1

   col1  col2  col3
0     1     5     2
1     5    10    10
2    17    17     5
3     5    26    17
4    17    37    82

In [172]:
f2 = lambda x : x**2 + 1 if x % 2 else x ** 2
df.applymap(f2)

   col1  col2  col3
0     0     4     2
1     4    10    10
2    16    16     4
3     4    26    16
4    16    36    82

In [ ]:
#df.apply(f2) -> Value 에러가 남

In [173]:
# numpy 함수는 사용가능.
# f2는 스칼라를 입력받아 스칼라를 반환함.
# numpy의 sqrt는 벡터화 되어있는 함수라서 가능함.
df.applymap(np.sqrt)

       col1      col2      col3
0  0.000000  1.414214  1.000000
1  1.414214  1.732051  1.732051
2  2.000000  2.000000  1.414214
3  1.414214  2.236068  2.000000
4  2.000000  2.449490  3.000000

In [174]:
df.apply(np.sqrt)

       col1      col2      col3
0  0.000000  1.414214  1.000000
1  1.414214  1.732051  1.732051
2  2.000000  2.000000  1.414214
3  1.414214  2.236068  2.000000
4  2.000000  2.449490  3.000000

In [175]:
%%timeit
df.applymap(np.sqrt)

354 µs ± 3.01 µs per loop (mean ± std. dev. of 7 runs, 1000 loops each)

In [176]:
%%timeit
df.apply(np.sqrt)

22.2 µs ± 275 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [177]:
# apply 함수가 10배 이상 빠름!

## pipe : DataFrame 전체에 함수 적용

In [179]:
# df.pipe(f2) value Error 발생

In [180]:
df.pipe(np.sqrt)  #numpy 함수는 벡터화 되어있어서 2차원 배열을 입력으로 받아 반환할 수 있기 때문.

       col1      col2      col3
0  0.000000  1.414214  1.000000
1  1.414214  1.732051  1.732051
2  2.000000  2.000000  1.414214
3  1.414214  2.236068  2.000000
4  2.000000  2.449490  3.000000

In [181]:
df

   col1  col2  col3
0     0     2     1
1     2     3     3
2     4     4     2
3     2     5     4
4     4     6     9

In [182]:
f3 = lambda x : x['col1'] * x['col2']

In [183]:
df.pipe(f3)

0     0
1     6
2    16
3    10
4    24
dtype: int64

In [184]:
df['col1'] * df['col2']

0     0
1     6
2    16
3    10
4    24
dtype: int64

In [185]:
%%timeit
df.pipe(f3)

44.6 µs ± 265 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [186]:
%%timeit
df['col1'] * df['col2']

43.9 µs ± 747 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

## Dataset에서 임의의 샘플 추출하기
- pandas.DataFrame.sample

In [189]:
scores.head()

           학번    소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
길은영  20267377  일본학과   3   61   69   46   79   57   77   56   65
임희윤  20337377  심리학과   2   76   62   62   64   77  100   51   94
류준산  20266173  경제학과   2   98   84   79   87   70   97   89   52
한성빈  20314864  경제학과   3   75   63   59   81   83   90   93   71
김화원  20277416  경영학과   3   45   90   86   94   94   52   76   84

In [191]:
# 실행할 때 마다 무작위의 n개의 행 반환
scores.sample(10)

           학번         소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
김주성  20257459     빅데이터전공   3   67   89   65   70   58   46   89   59
김화원  20277416       경영학과   3   45   90   86   94   94   52   76   84
현상연  20328616     빅데이터전공   2   96   91   85   78   77   57   65   59
권태민  20316593      전자공학과   3   98   72   84   59   89   73   59   71
이소원  20274870      전자공학과   2   61   69   52   66   62   65   67   70
구준찬  20318889  소프트웨어융합대학   1   57   79   60   58   75   65   81   61
나동민  20267452    콘텐츠IT전공   3   71   69   89   90   84   60   71   96
류상수  20317399   스마트IoT전공   2   95   67   49   99   43   53  100   78
윤원헌  20287476     빅데이터전공   3   98   98   80   72   80   65   89   88
김성혁  20287422  소프트웨어융합대학   1   93   81   99   88   55   45   81   95

In [196]:
scores.sample(frac = 0.25) # 76 * 0.25 인 19행 반환

           학번        소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
길은영  20267377      일본학과   3   61   69   46   79   57   77   56   65
조대욱  20256200    빅데이터전공   3   95   60   69   60   56   86   66   67
이재지  20297439  스마트IoT전공   2   74   55   99  100   89   83   60   73
함재원  20317303   콘텐츠IT전공   2   82   67   79   89   74   71   60   57
안주영  20255886    빅데이터전공   3   52   80   96   48   66   57   93   56
이지훈  20327392    빅데이터전공   2   91   90   76   90   87   91   72   69
김재성  20308862   ICT융합전공   3   85   92   92   45   81   67   78   58
김주성  20257459    빅데이터전공   3   67   89   65   70   58   46   89   59
강화윤  20278703     생명과학과   3   77   60   73   87   56   88   93   75
이재수  20327371   콘텐츠IT전공   2   56   86   98   85   65   70   93   57
함민윤  20287478    빅데이터전공   2   47   70  100   77   97   63   46   84
김태찬  20327409   콘텐츠IT전공   2   76   78   85   95   76   64   91   96
이강현  20297381    빅데이터전공   2   55   91   90   59   59   94   66   94
구영수  20317381    빅데이터전공   2   59   64   60   70   74  100   58   86
김여환  20277462    빅데이터전공   2   64   65   87   66   92   76   78   97
류성연  20293832    빅데이터전공   3   78   68   75   88   82   48   98   79
고병훈  20255161   콘텐츠IT전공   2   99   92   72   47   69   73   48   82
김소윤  20287329    빅데이터전공   2   52   65   79   69   77   99   62   52
조승환  20287374    컴퓨터공학과   4   66   66   74   52   93   48  100   83

## 데이터 정규화

In [197]:
scores.describe()

,학번,학년,과제1,과제2,과제3,과제4,과제5,과제6,과제7,과제8
count,7.600000e+01,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.00000,76.000000,76.000000
mean,2.029755e+07,2.434211,73.710526,72.592105,73.789474,74.736842,73.736842,71.50000,72.763158,76.223684
std,2.344483e+04,0.821957,16.207666,14.072363,16.248336,16.246738,15.092045,17.79026,16.229905,15.236446
min,2.025516e+07,1.000000,45.000000,42.000000,41.000000,45.000000,43.000000,41.00000,41.000000,43.000000
25%,2.027745e+07,2.000000,60.000000,63.000000,60.000000,60.750000,60.000000,57.00000,60.750000,63.500000
50%,2.029741e+07,2.000000,71.000000,69.500000,74.500000,75.000000,74.500000,71.50000,72.500000,78.000000
75%,2.031738e+07,3.000000,89.500000,84.000000,87.000000,88.250000,87.000000,88.00000,84.500000,88.500000
max,2.033740e+07,4.000000,100.000000,99.000000,100.000000,100.000000,100.000000,100.00000,100.000000,100.000000

## maximum absolute scaling

In [198]:
scores_max_scaled = scores.copy()
columns = ['과제1', '과제2', '과제3', '과제4', '과제5', '과제6', '과제7', '과제8']

for column in columns:
    _max = scores_max_scaled[column].abs().max()
    scores_max_scaled[column] = scores_max_scaled[column] / _max
    
scores_max_scaled.describe()

,학번,학년,과제1,과제2,과제3,과제4,과제5,과제6,과제7,과제8
count,7.600000e+01,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000
mean,2.029755e+07,2.434211,0.737105,0.733254,0.737895,0.747368,0.737368,0.715000,0.727632,0.762237
std,2.344483e+04,0.821957,0.162077,0.142145,0.162483,0.162467,0.150920,0.177903,0.162299,0.152364
min,2.025516e+07,1.000000,0.450000,0.424242,0.410000,0.450000,0.430000,0.410000,0.410000,0.430000
25%,2.027745e+07,2.000000,0.600000,0.636364,0.600000,0.607500,0.600000,0.570000,0.607500,0.635000
50%,2.029741e+07,2.000000,0.710000,0.702020,0.745000,0.750000,0.745000,0.715000,0.725000,0.780000
75%,2.031738e+07,3.000000,0.895000,0.848485,0.870000,0.882500,0.870000,0.880000,0.845000,0.885000
max,2.033740e+07,4.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [199]:
scores_max_scaled = scores.copy()
columns = ['과제1', '과제2', '과제3', '과제4', '과제5', '과제6', '과제7', '과제8']

for column in columns:
    _max = scores_max_scaled[column].max()
    scores_max_scaled[column] = scores_max_scaled[column] / _max
    
scores_max_scaled.describe()

,학번,학년,과제1,과제2,과제3,과제4,과제5,과제6,과제7,과제8
count,7.600000e+01,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000
mean,2.029755e+07,2.434211,0.737105,0.733254,0.737895,0.747368,0.737368,0.715000,0.727632,0.762237
std,2.344483e+04,0.821957,0.162077,0.142145,0.162483,0.162467,0.150920,0.177903,0.162299,0.152364
min,2.025516e+07,1.000000,0.450000,0.424242,0.410000,0.450000,0.430000,0.410000,0.410000,0.430000
25%,2.027745e+07,2.000000,0.600000,0.636364,0.600000,0.607500,0.600000,0.570000,0.607500,0.635000
50%,2.029741e+07,2.000000,0.710000,0.702020,0.745000,0.750000,0.745000,0.715000,0.725000,0.780000
75%,2.031738e+07,3.000000,0.895000,0.848485,0.870000,0.882500,0.870000,0.880000,0.845000,0.885000
max,2.033740e+07,4.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## Min_max_scaling

In [200]:
scores_max_scaled = scores.copy()
columns = ['과제1', '과제2', '과제3', '과제4', '과제5', '과제6', '과제7', '과제8']

for column in columns:
    _max = scores_max_scaled[column].max()
    _min = scores_max_scaled[column].min()
    scores_max_scaled[column] = (scores_max_scaled[column] - _min) / (_max - _min)
    
scores_max_scaled.describe()

,학번,학년,과제1,과제2,과제3,과제4,과제5,과제6,과제7,과제8
count,7.600000e+01,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000,76.000000
mean,2.029755e+07,2.434211,0.522010,0.536704,0.555754,0.540670,0.539243,0.516949,0.538359,0.582872
std,2.344483e+04,0.821957,0.294685,0.246884,0.275396,0.295395,0.264773,0.301530,0.275083,0.267306
min,2.025516e+07,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2.027745e+07,2.000000,0.272727,0.368421,0.322034,0.286364,0.298246,0.271186,0.334746,0.359649
50%,2.029741e+07,2.000000,0.472727,0.482456,0.567797,0.545455,0.552632,0.516949,0.533898,0.614035
75%,2.031738e+07,3.000000,0.809091,0.736842,0.779661,0.786364,0.771930,0.796610,0.737288,0.798246
max,2.033740e+07,4.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

## Z-score method

In [201]:
scores_max_scaled = scores.copy()
columns = ['과제1', '과제2', '과제3', '과제4', '과제5', '과제6', '과제7', '과제8']

for column in columns:
    _mean = scores_max_scaled[column].mean()
    _std = scores_max_scaled[column].std()
    scores_max_scaled[column] = (scores_max_scaled[column] - _mean) / _std
    
scores_max_scaled.describe()

,학번,학년,과제1,과제2,과제3,과제4,과제5,과제6,과제7,과제8
count,7.600000e+01,76.000000,7.600000e+01,7.600000e+01,7.600000e+01,7.600000e+01,7.600000e+01,7.600000e+01,7.600000e+01,7.600000e+01
mean,2.029755e+07,2.434211,-3.812740e-16,3.257628e-16,3.418318e-16,-3.798131e-16,-4.309418e-16,5.258951e-17,4.207161e-16,5.224713e-17
std,2.344483e+04,0.821957,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00
min,2.025516e+07,1.000000,-1.771417e+00,-2.173914e+00,-2.018020e+00,-1.830327e+00,-2.036625e+00,-1.714421e+00,-1.957076e+00,-2.180540e+00
25%,2.027745e+07,2.000000,-8.459285e-01,-6.816272e-01,-8.486699e-01,-8.609016e-01,-9.102042e-01,-8.150528e-01,-7.401866e-01,-8.350821e-01
50%,2.029741e+07,2.000000,-1.672373e-01,-2.197289e-01,4.372917e-02,1.619758e-02,5.056690e-02,0.000000e+00,-1.621438e-02,1.165833e-01
75%,2.031738e+07,3.000000,9.741979e-01,8.106595e-01,8.130387e-01,8.317459e-01,8.788178e-01,9.274738e-01,7.231615e-01,8.057204e-01
max,2.033740e+07,4.000000,1.622040e+00,1.876579e+00,1.613121e+00,1.554968e+00,1.740199e+00,1.602000e+00,1.678189e+00,1.560490e+00

## pandas.DataFrame.isin을 이용한 데이터 필터링

In [202]:
scores[scores['소속'] == '전자공학과']

           학번     소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
이소원  20274870  전자공학과   2   61   69   52   66   62   65   67   70
권태민  20316593  전자공학과   3   98   72   84   59   89   73   59   71
백동성  20268613  전자공학과   4   92   55   67   85   69   57   53   99

In [203]:
scores[(scores['소속'] == '전자공학과') | (scores['소속'] == '빅데이터전공')]

           학번      소속  학년  과제1  과제2  과제3  과제4  과제5  과제6  과제7  과제8
이름
현상연  20328616  빅데이터전공   2   96   91   85   78   77   57   65   59
이지훈  20327392  빅데이터전공   2   91   90   76   90   87   91   72   69
김소윤  20287329  빅데이터전공   2   52   65   79   69   77   99   62   52
함궁혁  20325215  빅데이터전공   2   70   60   87   89   84   93   60   62
김민우  20274344  빅데이터전공   3   63   46   84   87   91   51   65   62
이수연  20315232  빅데이터전공   3   97   62   62   61   57   72   97   61
이은석  20267518  빅데이터전공   3   64   88   59   99   52   42   84   57
윤원헌  20287476  빅데이터전공   3   98   98   80   72   80   65   89   88
박민용  20297366  빅데이터전공   3   50   63   91   72   59   99   73   88
김동원  20315272  빅데이터전공   3   98   79   95   70   75   57   50   98
김주성  20257459  빅데이터전공   3   67   89   65   70   58   46   89   59
이소원  20274870   전자공학과   2   61   69   52   66   62   65   67   70
권태민  20316593   전자공학과   3   98   72   84   59   89   73   59   71
백동성  20268613   전자공학과   4   92   55   67   85   69   57   53   99
장민하  20263847  빅데이터전공   3   60   79   84   81   87   49   61   93
류성연  20293832  빅데이터전공   3   78   68   75   88   82   48   98   79
안주영  20255886  빅데이터전공   3   52   80   96   48   66   57   93   56
구영수  20317381  빅데이터전공   2   59   64   60   70   74  100   58   86
조대욱  20256200  빅데이터전공   3   95   60   69   60   56   86   66   67
함민윤  20287478  빅데이터전공   2   47   70  100   77   97   63   46   84
이강현  20297381  빅데이터전공   2   55   91   90   59   59   94   66   94
심성영  20287540  빅데이터전공   2   56   96   80   79   95   92   71   65
이재빈  20297433  빅데이터전공   2   80   53   43   66   85   78   82   66
길대민  20317391  빅데이터전공   2   86   74   94   79   84   46   79   84
함성현  20285865  빅데이터전공   2   68   74   91   67   53   57   62   77
유승현  20293372  빅데이터전공   2   70   75   61   63  100   57   79   59
임강규  20287373  빅데이터전공   2   70   88   71   94   85  100   94   67
정서성  20287480  빅데이터전공   4   54   42   49   69   60   41   49  100
배상윤  20337358  빅데이터전공   2   98   58   60   53   43   65  100   79
윤주인  20337397  빅데이터전공   4   68   62   78   52   65   99   63   80
김여환  20277462  빅데이터전공   2   64   65   87   66   92   76   78   97
이은경  20318996  빅데이터전공   2   67   62   53   55   61   94   95   76

In [205]:
scores['소속'].isin(['전자공학과', '빅데이터전공'])

이름
길은영    False
임희윤    False
류준산    False
한성빈    False
김화원    False
       ...
신한산    False
윤주인     True
김여환     True
남용원    False
이은경     True
Name: 소속, Length: 76, dtype: bool